modm-ext/data.modm.io/docs/svd/header_stm32h750xx.svd
        <register>
          <name>D3PCR1L</name>
          <description>EXTI D3 Pending clear selection register low, (same register as to SRDPCR1L)</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PCS0</name>
              <description>D3 Pending request clear input signal selection on line 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS1</name>
              <description>D3 Pending request clear input signal selection on line 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS2</name>
              <description>D3 Pending request clear input signal selection on line 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS3</name>
              <description>D3 Pending request clear input signal selection on line 3</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS4</name>
              <description>D3 Pending request clear input signal selection on line 4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS5</name>
              <description>D3 Pending request clear input signal selection on line 5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS6</name>
              <description>D3 Pending request clear input signal selection on line 6</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS7</name>
              <description>D3 Pending request clear input signal selection on line 7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS8</name>
              <description>D3 Pending request clear input signal selection on line 8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS9</name>
              <description>D3 Pending request clear input signal selection on line 9</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS10</name>
              <description>D3 Pending request clear input signal selection on line 10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS11</name>
              <description>D3 Pending request clear input signal selection on line 11</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS12</name>
              <description>D3 Pending request clear input signal selection on line 12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS13</name>
              <description>D3 Pending request clear input signal selection on line 13</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS14</name>
              <description>D3 Pending request clear input signal selection on line 14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS15</name>
              <description>D3 Pending request clear input signal selection on line 15</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PCR1H</name>
          <description>EXTI D3 Pending clear selection register High, (same register as to SRDPCR1H)</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PCS19</name>
              <description>D3 Pending request clear input signal selection on line 19</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS20</name>
              <description>D3 Pending request clear input signal selection on line 20</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS21</name>
              <description>D3 Pending request clear input signal selection on line 21</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS25</name>
              <description>D3 Pending request clear input signal selection on line 25</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSR2</name>
          <description>EXTI Rising trigger selection register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TR49</name>
              <description>Rising trigger event configuration bit of line 49</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR51</name>
              <description>Rising trigger event configuration bit of line 51</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR2</name>
          <description>EXTI Falling trigger selection register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TR49</name>
              <description>Falling trigger event configuration bit of line 49</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR51</name>
              <description>Falling trigger event configuration bit of line 51</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER2</name>
          <description>EXTI Software interrupt event register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWIER49</name>
              <description>Software Interrupt on line 49</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIER51</name>
              <description>Software Interrupt on line 51</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PMR2</name>
          <description>EXTI D3 Pending mask register, (same register as to SRDPMR2)</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>MR34</name>
              <description>Pending Mask Event for line 34</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR35</name>
              <description>Pending Mask Event for line 35</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR41</name>
              <description>Pending Mask Event for line 41</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR48</name>
              <description>Pending Mask Event for line 48</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR49</name>
              <description>Pending Mask Event for line 49</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR50</name>
              <description>Pending Mask Event for line 50</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR51</name>
              <description>Pending Mask Event for line 51</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR52</name>
              <description>Pending Mask Event for line 52</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MR53</name>
              <description>Pending Mask Event for line 53</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PCR2L</name>
          <description>EXTI D3 Pending clear selection register low, (same register as to SRDPCR2L)</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PCS34</name>
              <description>D3 Pending request clear input signal selection on line 34</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS35</name>
              <description>D3 Pending request clear input signal selection on line 35</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS41</name>
              <description>D3 Pending request clear input signal selection on line 41</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PCR2H</name>
          <description>EXTI D3 Pending clear selection register High, (same register as to SRDPCR2H)</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PCS48</name>
              <description>D3 Pending request clear input signal selection on line 48</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS49</name>
              <description>D3 Pending request clear input signal selection on line 49</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS50</name>
              <description>D3 Pending request clear input signal selection on line 50</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS51</name>
              <description>D3 Pending request clear input signal selection on line 51</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS52</name>
              <description>D3 Pending request clear input signal selection on line 52</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PCS53</name>
              <description>D3 Pending request clear input signal selection on line 53</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RTSR3</name>
          <description>EXTI Rising trigger selection register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TR82</name>
              <description>Rising trigger event configuration bit of line 82</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR84</name>
              <description>Rising trigger event configuration bit of line 84</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR85</name>
              <description>Rising trigger event configuration bit of line 85</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR86</name>
              <description>Rising trigger event configuration bit of line 86</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR3</name>
          <description>EXTI Falling trigger selection register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TR82</name>
              <description>Falling trigger event configuration bit of line 82</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR84</name>
              <description>Falling trigger event configuration bit of line 84</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR85</name>
              <description>Falling trigger event configuration bit of line 85</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TR86</name>
              <description>Falling trigger event configuration bit of line 86</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER3</name>
          <description>EXTI Software interrupt event register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWIER82</name>
              <description>Software Interrupt on line 82</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIER84</name>
              <description>Software Interrupt on line 84</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIER85</name>
              <description>Software Interrupt on line 85</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWIER86</name>
              <description>Software Interrupt on line 86</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>D3PMR3</name>
          <description>EXTI D3 Pending mask register, (same register as to SRDPMR3)</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>D3PCR3L</name>
          <description>EXTI D3 Pending clear selection register low, (same register as to SRDPCR3L)</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>D3PCR3H</name>
          <description>EXTI D3 Pending clear selection register High, (same register as to SRDPCR3H)</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
        </register>
